In [1]:
import pandas as pd
import random as rd
import numpy as np

In [2]:
Names = ['Pranav','Aryan','Anurag','Shiva','Sankar']
Math = pd.DataFrame(
    {'Names' : Names,'Math': rd.sample(range(90,101),5)})

Science = pd.DataFrame(
    {'Science' : rd.sample(range(70,80),3), 'Names':Names[0:3]} )

In [3]:
Math

    Names  Math
0  Pranav    99
1   Aryan    97
2  Anurag    93
3   Shiva    98
4  Sankar    91

In [4]:
Science

   Science   Names
0       78  Pranav
1       76   Aryan
2       73  Anurag

In [5]:
#Merging the dataframes with different number of indices
pd.merge(Math,Science)

    Names  Math  Science
0  Pranav    99       78
1   Aryan    97       76
2  Anurag    93       73

In [6]:
#Merging the dataframes with different number of indices but we use student name as a key here 
pd.merge(Math,Science,on = 'Names')

    Names  Math  Science
0  Pranav    99       78
1   Aryan    97       76
2  Anurag    93       73

In [7]:
pd.merge(Math,Science,on='Names',how='left').fillna('--')

    Names  Math Science
0  Pranav    99      78
1   Aryan    97      76
2  Anurag    93      73
3   Shiva    98      --
4  Sankar    91      --

In [8]:
#Concatenate the dataframes
pd.concat([Math,Science],ignore_index=True)

    Names  Math  Science
0  Pranav  99.0      NaN
1   Aryan  97.0      NaN
2  Anurag  93.0      NaN
3   Shiva  98.0      NaN
4  Sankar  91.0      NaN
5  Pranav   NaN     78.0
6   Aryan   NaN     76.0
7  Anurag   NaN     73.0

In [9]:
Student_Survey_DatFrame = pd.DataFrame({
        'Names' : ['Pranav' , 'Anu' ,'Anu' ,'Aryan' ,'Pranav'] , 
        'Rating' : [1,3,3,5,1]
        
    })

In [10]:
Student_Survey_DatFrame

    Names  Rating
0  Pranav       1
1     Anu       3
2     Anu       3
3   Aryan       5
4  Pranav       1

In [11]:
Student_Survey_DatFrame.duplicated()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [12]:
Student_Survey_DatFrame.drop_duplicates('Names')

    Names  Rating
0  Pranav       1
1     Anu       3
3   Aryan       5

In [13]:
Student_Survey_DatFrame.drop_duplicates('Rating')

    Names  Rating
0  Pranav       1
1     Anu       3
3   Aryan       5